Revit 2027 API
IFCImportOptions.AutoJoin Property
 Enable or disable auto-join at the end of import.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AutoJoin { get; set; }
Public Property AutoJoin As Boolean
	Get
	Set
public:
property bool AutoJoin {
	bool get ();
	void set (bool value);
}
member AutoJoin : bool with get, set
Property Value
Boolean
Remarks
 Enabling auto-join will join appropriate elements (e.g., walls, columns), but will take extra time and may fail. Disabling auto-join will allow some imports that otherwise fail. Default is true for Open IFC; it is ignored (and false) for Link IFC.
See Also
Reference
IFCImportOptions Class
Autodesk.Revit.DB.IFC Namespace